{
    "<PAD>": 0,
    "<UNK>": 1,
    "<START>": 2,
    "<STOP>": 3,
    "C": 4,
    "O": 5,
    "N": 6,
    "S": 7,
    "=": 8,
    "Br": 9,
    "I": 10,
    "F": 11,
    "#": 12,
    "Cl": 13,
    "(": 14,
    ")": 15,
    "1": 16,
    "[NH]": 17,
    "[P]": 18,
    "[N]": 19,
    "P": 20,
    "[N+]": 21,
    "[S+]": 22,
    "[C-]": 23,
    "[O+]": 24,
    "[I]": 25,
    "[O-]": 26,
    "2": 27,
    "[Br]": 28,
    "[Cl]": 29,
    "[N-]": 30,
    "[P+]": 31,
    "[O]": 32,
    "3": 33,
    "[CH-]": 34,
    "[P-]": 35,
    "4": 36,
    "5": 37,
    "[I++]": 38,
    "[CH2]": 39,
    "B": 40,
    "[I+]": 41,
    "[IH]": 42,
    "[CH]": 43,
    "-": 44,
    "[S-]": 45,
    "p": 46,
    "6": 47,
    "[C]": 48,
    "\\": 49,
    "/": 50,
    "[B-]": 51,
    "7": 52,
    "[C+]": 53,
    "[NH-]": 54,
    "[NH2+]": 55,
    ".": 56,
    "8": 57,
    "9": 58,
    "[NH+]": 59,
    "[OH+]": 60,
    "[F]": 61,
    "%10": 62,
    "%11": 63,
    "[H]": 64,
    "[NH3+]": 65,
    "%12": 66,
    "%13": 67,
    "%14": 68,
    "%15": 69,
    "%16": 70,
    "%17": 71,
    "%18": 72,
    "%19": 73,
    "%20": 74,
    "%21": 75,
    "%22": 76,
    "%23": 77,
    "%24": 78,
    "[C@@H]": 79,
    "[C@@]": 80,
    "[C@]": 81,
    "[C@H]": 82,
    "[Pt]": 83,
    "[AS]": 84,
    "[N@@]": 85,
    "[S@@]": 86,
    "s": 87,
    "c": 88,
    "n": 89,
    "o": 90,
    "[nH]": 91,
    "[n+]": 92,
    "[As]": 93,
    "[s+]": 94,
    "[o+]": 95,
    "[c-]": 96,
    "[n-]": 97,
    "[cH-]": 98,
    "[c+]": 99,
    "[nH+]": 100,
    "[Cl-]": 101,
    "[Na+]": 102,
    "[NH4+]": 103,
    "[Hg]": 104,
    "[Br-]": 105,
    "[N@]": 106,
    "[Ca++]": 107,
    "[Sn]": 108,
    "[I-]": 109,
    "[Co+]": 110,
    "[N@@+]": 111,
    "[K+]": 112,
    "[Fe--]": 113,
    "[N@+]": 114,
    "[Fe+3]": 115,
    "[Gd+3]": 116,
    "[Zn++]": 117,
    "[Al]": 118,
    "[Hg++]": 119,
    "[Cu++]": 120,
    "[Zn]": 121,
    "[Au-]": 122,
    "[Au]": 123,
    "[Cr]": 124,
    "[Cd++]": 125,
    "[Cd]": 126,
    "[Si]": 127,
    "[Sb]": 128,
    "[Se]": 129,
    "[Cu]": 130,
    "[Li+]": 131,
    "[Tl+]": 132,
    "[Bi]": 133,
    "[In]": 134,
    "[Ca]": 135,
    "[Dy]": 136,
    "[Co++]": 137,
    "[Cr+3]": 138,
    "[Fe++]": 139,
    "[Pt-2]": 140,
    "[Sb+3]": 141,
    "[Be++]": 142,
    "[Mg++]": 143,
    "[Ti]": 144,
    "[Fe-]": 145,
    "[Nd]": 146,
    "[Pd]": 147,
    "[Ba++]": 148,
    "[H+]": 149,
    "[Mn+]": 150,
    "[Mn++]": 151,
    "[SiH]": 152,
    "[Ni++]": 153,
    "[Zr]": 154,
    "[Ni]": 155,
    "[PbH2++]": 156,
    "[Yb]": 157,
    "[Na]": 158,
    "[Mo]": 159,
    "[Cu+]": 160,
    "[Ge]": 161,
    "[Ba]": 162,
    "[Cr++]": 163,
    "[OH-]": 164,
    "[SnH2++]": 165,
    "[Mg+2]": 166,
    "[V]": 167,
    "[Ag+]": 168,
    "[Pt+2]": 169,
    "[2H]": 170,
    "[Ti++]": 171,
    "[Sr++]": 172,
    "[Ru]": 173,
    "[P@]": 174,
    "[Li]": 175,
    "[As+]": 176,
    "[Fe]": 177,
    "[Eu]": 178,
    "[Sc]": 179,
    "[Zn+2]": 180,
    "[Ca+2]": 181,
    "[Hg+2]": 182,
    "[Cl+3]": 183,
    "[Ba+2]": 184,
    "[TlH2+]": 185,
    "[Fe+2]": 186,
    "[AlH3]": 187,
    "[PH]": 188,
    "[Co+2]": 189,
    "[Cu+2]": 190,
    "[PbH2+2]": 191,
    "[Ni+2]": 192,
    "[Cd+2]": 193,
    "[SnH2+2]": 194,
    "[Ti+2]": 195,
    "[Mn+2]": 196,
    "[Sr+2]": 197,
    "[Be+2]": 198,
    "[se]": 199,
    "[Cr+2]": 200,
    "[SbH6+3]": 201,
    "[Fe-2]": 202,
    "[Br+2]": 203,
    "[Cl+2]": 204,
    "[Cl+]": 205,
    "[S@]": 206,
    "[P@@]": 207,
    "[S@+]": 208,
    "[S@@+]": 209,
    "[N@@H+]": 210,
    "[CH+]": 211,
    "[SH]": 212,
    "[18F]": 213,
    "[123I]": 214,
    "[S]": 215,
    "[O--]": 216,
    "[B+3]": 217,
    "[B]": 218,
    "[Al+3]": 219,
    "[F-]": 220,
    "[PH3+]": 221,
    ":": 222,
    "[SH-]": 223,
    "[CH2-]": 224,
    "[Gd-4]": 225,
    "[Gd-5]": 226,
    "[SiH3]": 227,
    "[BiH3]": 228,
    "[SeH]": 229,
    "[SiH2]": 230,
    "[Re+]": 231,
    "[Re]": 232,
    "[OH2+]": 233,
    "[SH+]": 234,
    "0": 235,
    "|": 236,
    " |": 237,
    ",": 238,
    "[K]": 239,
    " |r|": 240,
    "[N@H+]": 241,
    "[Co]": 242,
    "[Te]": 243,
    "[Os]": 244,
    "[Ru-]": 245,
    "[Re-]": 246,
    "[Zn+]": 247,
    "[n]": 248,
    "[o]": 249,
    "[s]": 250,
    "[*]": 251,
    "[CH2+]": 252,
    "[c]": 253,
    "[Mn]": 254,
    "[BH-]": 255,
    "[BH3-]": 256,
    "[11CH3]": 257,
    "[PH+]": 258,
    "[W]": 259,
    "[Nb--]": 260,
    "[Pt--]": 261,
    "[Fe-3]": 262,
    "[Al-3]": 263,
    "[Cu-]": 264,
    "[Ag-]": 265,
    "[As-]": 266,
    "[Pd--]": 267,
    "[Se-]": 268,
    "[3H]": 269,
    "[BH2-]": 270,
    "[125I]": 271,
    "[B--]": 272,
    "[cH+]": 273
}