{
    "vocab": {
        "<PAD>": 0,
        "<UNK>": 1,
        "<START>": 2,
        "<STOP>": 3,
        "C": 4,
        "O": 5,
        "N": 6,
        "S": 7,
        "=": 8,
        "Br": 9,
        "I": 10,
        "F": 11,
        "#": 12,
        "Cl": 13,
        "(": 14,
        ")": 15,
        "1": 16,
        "[NH]": 17,
        "[P]": 18,
        "[N]": 19,
        "P": 20,
        "[N+]": 21,
        "[S+]": 22,
        "[C-]": 23,
        "[O+]": 24,
        "[I]": 25,
        "[O-]": 26,
        "2": 27,
        "[Br]": 28,
        "[Cl]": 29,
        "[N-]": 30,
        "[P+]": 31,
        "[O]": 32,
        "3": 33,
        "[CH-]": 34,
        "[P-]": 35,
        "4": 36,
        "5": 37,
        "[I++]": 38,
        "[CH2]": 39,
        "B": 40,
        "[I+]": 41,
        "[IH]": 42,
        "[CH]": 43,
        "-": 44,
        "[S-]": 45,
        "p": 46,
        "6": 47,
        "[C]": 48,
        "\\": 49,
        "/": 50,
        "[B-]": 51,
        "7": 52,
        "[C+]": 53,
        "[NH-]": 54,
        "[NH2+]": 55,
        ".": 56,
        "8": 57,
        "9": 58,
        "[NH+]": 59,
        "[OH+]": 60,
        "[F]": 61,
        "%10": 62,
        "%11": 63,
        "[H]": 64,
        "[NH3+]": 65,
        "%12": 66,
        "%13": 67,
        "%14": 68,
        "%15": 69,
        "%16": 70,
        "%17": 71,
        "%18": 72,
        "%19": 73,
        "%20": 74,
        "%21": 75,
        "%22": 76,
        "%23": 77,
        "%24": 78,
        "[C@@H]": 79,
        "[C@@]": 80,
        "[C@]": 81,
        "[C@H]": 82,
        "[Pt]": 83,
        "[AS]": 84,
        "[N@@]": 85,
        "[S@@]": 86
    },
    "max_token_sequence_length": 1261,
    "token_count": {
        "C": 34384148,
        "O": 5541302,
        "N": 5029443,
        "S": 631241,
        "=": 3869317,
        "Br": 74288,
        "I": 10794,
        "F": 554964,
        "#": 102247,
        "Cl": 351335,
        "(": 8274393,
        ")": 8274393,
        "1": 6136374,
        "[NH]": 147226,
        "[P]": 2,
        "[N]": 33,
        "P": 38136,
        "[N+]": 31162,
        "[S+]": 460,
        "[C-]": 726,
        "[O+]": 439,
        "[I]": 37,
        "[O-]": 10419,
        "2": 3197396,
        "[Br]": 1,
        "[Cl]": 2,
        "[N-]": 3224,
        "[P+]": 580,
        "[O]": 830,
        "3": 1171310,
        "[CH-]": 172,
        "[P-]": 1,
        "4": 305350,
        "5": 71482,
        "[I++]": 7,
        "[CH2]": 1,
        "B": 99,
        "[I+]": 6,
        "[IH]": 1,
        "[CH]": 5,
        "-": 211,
        "[S-]": 8,
        "p": 37,
        "6": 19660,
        "[C]": 10,
        "\\": 605,
        "/": 377,
        "[B-]": 4,
        "7": 8340,
        "[C+]": 37,
        "[NH-]": 7,
        "[NH2+]": 10,
        ".": 63,
        "8": 3806,
        "9": 2134,
        "[NH+]": 17,
        "[OH+]": 1,
        "[F]": 1,
        "%10": 1294,
        "%11": 1082,
        "[H]": 1,
        "[NH3+]": 1,
        "%12": 858,
        "%13": 682,
        "%14": 428,
        "%15": 318,
        "%16": 264,
        "%17": 246,
        "%18": 166,
        "%19": 120,
        "%20": 120,
        "%21": 98,
        "%22": 28,
        "%23": 16,
        "%24": 16,
        "[C@@H]": 444,
        "[C@@]": 47,
        "[C@]": 60,
        "[C@H]": 483,
        "[Pt]": 10,
        "[AS]": 3,
        "[N@@]": 1,
        "[S@@]": 1
    }
}